---
kind: type
id: T:Autodesk.Revit.DB.Solid
source: html/7a3b5ac1-c66d-9f81-a11d-9bcd4e026295.htm
---
# Autodesk.Revit.DB.Solid

A 3d solid.

## Syntax (C#)
```csharp
public class Solid : GeometryObject
```

## Remarks
A solid is defined by the faces and edges that form its boundary.